In [19]:
import pandas as pd        # Series and dataframes

In [20]:
lst = ['this', 'is', 'python', 'workshop']
df = pd.DataFrame(lst)
df

          0
0      this
1        is
2    python
3  workshop

In [21]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'],'Age':[20, 21, 19, 18]}
df = pd.DataFrame(data)
df

   Age   Name
0   20    Tom
1   21   nick
2   19  krish
3   18   jack

In [24]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data)
print(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [9]:
Data =[1, 3, 4, 5, 6, 2, 9]
s = pd.Series(Data)
s

0    1
1    3
2    4
3    5
4    6
5    2
6    9
dtype: int64

In [10]:
dictionary ={'a':1, 'b':2, 'c':3, 'd':4, 'e':5}  
sd = pd.Series(dictionary)
sd

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
Data =[[2, 3, 4], [5, 6, 7]]  
snd = pd.Series(Data)
snd

0    [2, 3, 4]
1    [5, 6, 7]
dtype: object

In [13]:
dict1 ={'a':1, 'b':2, 'c':3, 'd':4}        
dict2 ={'a':5, 'b':6, 'c':7, 'd':8, 'e':9} 
Data = {'first':dict1, 'second':dict2}
df = pd.DataFrame(Data)
df

   first  second
a    1.0       5
b    2.0       6
c    3.0       7
d    4.0       8
e    NaN       9

In [15]:
s1 = pd.Series([1, 3, 4, 5, 6, 2, 9])      
s2 = pd.Series([1.1, 3.5, 4.7, 5.8, 2.9, 9.3])
s3 = pd.Series(['a', 'b', 'c', 'd', 'e'])     
Data ={'first':s1, 'second':s2, 'third':s3} 
dfseries = pd.DataFrame(Data)           
dfseries

   first  second third
0      1     1.1     a
1      3     3.5     b
2      4     4.7     c
3      5     5.8     d
4      6     2.9     e
5      2     9.3   NaN
6      9     NaN   NaN

In [17]:
d1 =[[2, 3, 4], [5, 6, 7]]
d2 =[[2, 4, 8], [1, 3, 9]]
Data ={'first': d1, 'second': d2} 
df2d = pd.DataFrame(Data)
df2d

       first     second
0  [2, 3, 4]  [2, 4, 8]
1  [5, 6, 7]  [1, 3, 9]